<?php




//Виведіть на екран тільки числа, які націло діляться на 3.
//Виведіть на екран мінімальне та максимальне значення з масиву.
//Для задач 2-6 не можна використовувати функції PHP (array_sum, array_product і т.д.), треба використовувати цикли

$arr = [];


for ($i = 0; $i <= 5; $i++) {
        $arr[] = rand(1,5);//Створити пустий масив і заповнити його 30 значеннями (значення можуть бути від 1 до 50). Значення повинні бути випадковими, для цього використовуйте функцію PHP rand
//        $countFive = array_count_values($arr)[5] ?? 0;//Перевірте скільки раз число 5 зустрічається у вас в масиві, та виведіть це число на екран.
}
print_r($arr);

echo "\n";
//print_r($countFive);
//Порахувати суму елементів масиву та вивести на екран.

$sum = 0;

for ($i = 0; $i < count($arr); $i++) {
    $sum += $arr[$i];
}
print_r($sum);

//for ($i = 0; $i < array_count_values($sum); $i++);
//








